~Version ---------------------------------------------------
VERS. 2.0 : CWLS log ASCII Standard -VERSION 2.0
WRAP.  NO : Режим одной строчки на временной отчет
~Well ------------------------------------------------------
STRT.ms 36414838.16700 : Время первой записи в файле
STOP.ms 36414838.16700 : Время последней записи в файле
STEP.ms              0 : Шаг времени, 0 - переменный шаг
NULL.          -999.25 : Метка, нет значения
DATE.       21/06/2024 : Дата каротажа
DRVD. LOOCH_TELE102_V2 : Наименование драйвера прибора
~Curve Information -----------------------------------------
TIME          .ms  : TIME, ms
Speed Set     .    : Измеренная скорсоть
Speed Meas    .    : Выставленная скорость
Angle Set     .    : Выставленный угол
Cur Position  .    : Текущее положение
CNT Value     .    : Счета таймера
Press         .    : Давление
Press ADC code.    : Давление - код АЦП
Current Press .    : Мгновенное давление
Target Press  .    : Выставленное давление
Power Supply  .    : Напряжение питания
Current       .    : Ток потребления
Calibr Null   .    : Калибровочный ноль
Min Angle     .    : Мин. угол
Max Angle     .    : Макс. угол
Min Press     .    : Мин. давление
Max Press     .    : Макс. давление
WorkZone      .    : Рабочая область
WorkState     .    : Состояние
WorkMode      .    : Режим работы
Error flag    .    : Флаг ошибок
Logical flag  .    : Флаг логики
~Params ----------------------------------------------------
~Other -----------------------------------------------------
~ASCII -----------------------------------------------------
 36414838.16700    0.00000    0.00000    0.00000    0.00000    0.00000 -635.00000 -8929.00000 -637.00000    0.00000 1199.00000    0.00000    0.00000    0.00000    0.00000    0.00000    0.00000    0.00000    0.00000    0.00000    0.00000    0.00000
36415182.21900	0.00000	0.00000	0.00000	0.00000	0.00000	-636.00000	-9005.00000	-637.00000	0.00000	1199.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000
36415527.32200	0.00000	0.00000	0.00000	0.00000	0.00000	-636.00000	-9007.00000	-637.00000	0.00000	1199.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000
36438443.00400	0.00000	0.00000	0.00000	0.00000	0.00000	-637.00000	-9091.00000	-637.00000	0.00000	1198.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000	0.00000
